package test

import (
	"testing"
	"toursystem/entity"
	"github.com/asaskevich/govalidator"
	. "github.com/onsi/gomega"
)

func TestTourDescriptions(t *testing.T) {  

	g := NewGomegaWithT(t)

	t.Run(`TourDescriptions is valid`, func(t *testing.T) {
		descriptions := entity.TourDescriptions{
			Intro:   			"สัมผัสความเงียบสงบและธรรมชาติที่บริสุทธิ์ของทะเลระนอง เปิดโลกการท่องเที่ยวสุดเอ็กซ์คลูซีฟกับแพ็กเกจทัวร์ทะเลระนอง ดินแดนที่ยังคงความงดงามดั้งเดิมของธรรมชาติ ทะเลใส หาดทรายขาว และหมู่เกาะที่ซ่อนตัวอยู่ในความสงบ เหมาะสำหรับผู้ที่ต้องการพักผ่อนและหลีกหนีจากความวุ่นวายของชีวิตประจำวัน",	        
			PackageDetail:		"จังหวัด: ระนอง ระยะเวลา: 2 วัน 2 คืน ที่พัก: รีสอร์ทหรูระดับ 4 ดาว พร้อมวิวทะเลส่วนตัว รวมอาหาร: อาหารครบทุกมื้อ เน้นซีฟู้ดสดใหม่จากทะเลระนอง การเดินทาง: รถรับ-ส่งสนามบินระนอง พร้อมเรือสปีดโบ๊ทส่วนตัวสำหรับทัวร์เกาะ",
			TripHighlight:		"🏝️ ทัวร์หมู่เกาะกำและเกาะค้างคาว สัมผัสหาดทรายขาวละเอียดและน้ำทะเลใสราวคริสตัลที่หมู่เกาะกำ เพลิดเพลินกับการดำน้ำตื้น(Snorkeling) เพื่อชมปะการังหลากสีสัน และปลาสวยงามนานาชนิด 🌅 ชิลล์บนเกาะพยาม สัมผัสกับวิถีชีวิตเรียบง่ายบนเกาะพยาม เกาะที่ขึ้นชื่อว่า มัลดีฟส์เมืองไทย ชมความงดงามของชายหาดที่เงียบสงบและดื่มด่ำกับพระอาทิตย์ตกดินสุดโรแมนติก 🛶 ล่องเรือชมป่าชายเลนและน้ำตกปุญญบาล ตื่นตาตื่นใจกับความสมบูรณ์ของป่าชายเลนที่อุดมสมบูรณ์ สำรวจน้ำตกปุญญบาลที่มีน้ำใสไหลเย็นตลอดปี ✨ บ่อน้ำพุร้อนรักษะวาริน ผ่อนคลายกับการแช่น้ำแร่ร้อนธรรมชาติที่บ่อน้ำพุร้อนรักษะวาริน สถานที่ท่องเที่ยวเพื่อสุขภาพที่ไม่ควรพลาด",
			PlacesHighlight:	"🌊 ดำน้ำดูปะการังและปลาสวยงาม: สัมผัสประสบการณ์ดำน้ำที่น่าตื่นเต้นในน้ำทะเลใสแจ๋ว 🌴 พักผ่อนท่ามกลางธรรมชาติ: ที่พักสุดหรูที่โอบล้อมด้วยธรรมชาติที่งดงาม 🍹 ปาร์ตี้ริมชายหาด: เพลิดเพลินกับปาร์ตี้บาร์บีคิวซีฟู้ดและเครื่องดื่มริมทะเลยามค่ำคืน",
			TourPackageID:	    1,
			TourPackage: &entity.TourPackages{
                TourName:    "แพ็กเกจทัวร์ทะเลระนอง: เปิดประสบการณ์สู่มนต์เสน่ห์แห่งอันดามันใต้",
                PackageCode: "T00001",
                Duration:    "2 วัน 2 คืน",
            },
		}
		ok, err := govalidator.ValidateStruct(descriptions)
		g.Expect(ok).To(BeTrue()) 
		g.Expect(err).To(BeNil()) 
	})
}


func TestIntro(t *testing.T) {

	g := NewGomegaWithT(t)

	t.Run(`intro is required`, func(t *testing.T) {
		descriptions := entity.TourDescriptions{
			Intro:   			"", //ผิดตรงนี้	        
			PackageDetail:		"จังหวัด: ระนอง ระยะเวลา: 2 วัน 2 คืน ที่พัก: รีสอร์ทหรูระดับ 4 ดาว พร้อมวิวทะเลส่วนตัว รวมอาหาร: อาหารครบทุกมื้อ เน้นซีฟู้ดสดใหม่จากทะเลระนอง การเดินทาง: รถรับ-ส่งสนามบินระนอง พร้อมเรือสปีดโบ๊ทส่วนตัวสำหรับทัวร์เกาะ",
			TripHighlight:		"🏝️ ทัวร์หมู่เกาะกำและเกาะค้างคาว สัมผัสหาดทรายขาวละเอียดและน้ำทะเลใสราวคริสตัลที่หมู่เกาะกำ เพลิดเพลินกับการดำน้ำตื้น(Snorkeling) เพื่อชมปะการังหลากสีสัน และปลาสวยงามนานาชนิด 🌅 ชิลล์บนเกาะพยาม สัมผัสกับวิถีชีวิตเรียบง่ายบนเกาะพยาม เกาะที่ขึ้นชื่อว่า มัลดีฟส์เมืองไทย ชมความงดงามของชายหาดที่เงียบสงบและดื่มด่ำกับพระอาทิตย์ตกดินสุดโรแมนติก 🛶 ล่องเรือชมป่าชายเลนและน้ำตกปุญญบาล ตื่นตาตื่นใจกับความสมบูรณ์ของป่าชายเลนที่อุดมสมบูรณ์ สำรวจน้ำตกปุญญบาลที่มีน้ำใสไหลเย็นตลอดปี ✨ บ่อน้ำพุร้อนรักษะวาริน ผ่อนคลายกับการแช่น้ำแร่ร้อนธรรมชาติที่บ่อน้ำพุร้อนรักษะวาริน สถานที่ท่องเที่ยวเพื่อสุขภาพที่ไม่ควรพลาด",
			PlacesHighlight:	"🌊 ดำน้ำดูปะการังและปลาสวยงาม: สัมผัสประสบการณ์ดำน้ำที่น่าตื่นเต้นในน้ำทะเลใสแจ๋ว 🌴 พักผ่อนท่ามกลางธรรมชาติ: ที่พักสุดหรูที่โอบล้อมด้วยธรรมชาติที่งดงาม 🍹 ปาร์ตี้ริมชายหาด: เพลิดเพลินกับปาร์ตี้บาร์บีคิวซีฟู้ดและเครื่องดื่มริมทะเลยามค่ำคืน",
			TourPackageID:	    1,
		}
		ok, err := govalidator.ValidateStruct(descriptions)
		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("Intro is required"))
	})
}


func TestPackageDetail(t *testing.T) {

	g := NewGomegaWithT(t)

	t.Run(`package_detail is required`, func(t *testing.T) {
		descriptions := entity.TourDescriptions{
			Intro:   			"สัมผัสความเงียบสงบและธรรมชาติที่บริสุทธิ์ของทะเลระนอง เปิดโลกการท่องเที่ยวสุดเอ็กซ์คลูซีฟกับแพ็กเกจทัวร์ทะเลระนอง ดินแดนที่ยังคงความงดงามดั้งเดิมของธรรมชาติ ทะเลใส หาดทรายขาว และหมู่เกาะที่ซ่อนตัวอยู่ในความสงบ เหมาะสำหรับผู้ที่ต้องการพักผ่อนและหลีกหนีจากความวุ่นวายของชีวิตประจำวัน",        
			PackageDetail:		"", //ผิดตรงนี้	 
			TripHighlight:		"🏝️ ทัวร์หมู่เกาะกำและเกาะค้างคาว สัมผัสหาดทรายขาวละเอียดและน้ำทะเลใสราวคริสตัลที่หมู่เกาะกำ เพลิดเพลินกับการดำน้ำตื้น(Snorkeling) เพื่อชมปะการังหลากสีสัน และปลาสวยงามนานาชนิด 🌅 ชิลล์บนเกาะพยาม สัมผัสกับวิถีชีวิตเรียบง่ายบนเกาะพยาม เกาะที่ขึ้นชื่อว่า มัลดีฟส์เมืองไทย ชมความงดงามของชายหาดที่เงียบสงบและดื่มด่ำกับพระอาทิตย์ตกดินสุดโรแมนติก 🛶 ล่องเรือชมป่าชายเลนและน้ำตกปุญญบาล ตื่นตาตื่นใจกับความสมบูรณ์ของป่าชายเลนที่อุดมสมบูรณ์ สำรวจน้ำตกปุญญบาลที่มีน้ำใสไหลเย็นตลอดปี ✨ บ่อน้ำพุร้อนรักษะวาริน ผ่อนคลายกับการแช่น้ำแร่ร้อนธรรมชาติที่บ่อน้ำพุร้อนรักษะวาริน สถานที่ท่องเที่ยวเพื่อสุขภาพที่ไม่ควรพลาด",
			PlacesHighlight:	"🌊 ดำน้ำดูปะการังและปลาสวยงาม: สัมผัสประสบการณ์ดำน้ำที่น่าตื่นเต้นในน้ำทะเลใสแจ๋ว 🌴 พักผ่อนท่ามกลางธรรมชาติ: ที่พักสุดหรูที่โอบล้อมด้วยธรรมชาติที่งดงาม 🍹 ปาร์ตี้ริมชายหาด: เพลิดเพลินกับปาร์ตี้บาร์บีคิวซีฟู้ดและเครื่องดื่มริมทะเลยามค่ำคืน",
			TourPackageID:	    1,
		}
		ok, err := govalidator.ValidateStruct(descriptions)
		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("PackageDetail is required"))
	})
}

func TestTripHighlight(t *testing.T) {

	g := NewGomegaWithT(t)

	t.Run(`trip_highlight is required`, func(t *testing.T) {
		descriptions := entity.TourDescriptions{
			Intro:   			"สัมผัสความเงียบสงบและธรรมชาติที่บริสุทธิ์ของทะเลระนอง เปิดโลกการท่องเที่ยวสุดเอ็กซ์คลูซีฟกับแพ็กเกจทัวร์ทะเลระนอง ดินแดนที่ยังคงความงดงามดั้งเดิมของธรรมชาติ ทะเลใส หาดทรายขาว และหมู่เกาะที่ซ่อนตัวอยู่ในความสงบ เหมาะสำหรับผู้ที่ต้องการพักผ่อนและหลีกหนีจากความวุ่นวายของชีวิตประจำวัน",        
			PackageDetail:		"จังหวัด: ระนอง ระยะเวลา: 2 วัน 2 คืน ที่พัก: รีสอร์ทหรูระดับ 4 ดาว พร้อมวิวทะเลส่วนตัว รวมอาหาร: อาหารครบทุกมื้อ เน้นซีฟู้ดสดใหม่จากทะเลระนอง การเดินทาง: รถรับ-ส่งสนามบินระนอง พร้อมเรือสปีดโบ๊ทส่วนตัวสำหรับทัวร์เกาะ",  
			TripHighlight:		"", //ผิดตรงนี้	
			PlacesHighlight:	"🌊 ดำน้ำดูปะการังและปลาสวยงาม: สัมผัสประสบการณ์ดำน้ำที่น่าตื่นเต้นในน้ำทะเลใสแจ๋ว 🌴 พักผ่อนท่ามกลางธรรมชาติ: ที่พักสุดหรูที่โอบล้อมด้วยธรรมชาติที่งดงาม 🍹 ปาร์ตี้ริมชายหาด: เพลิดเพลินกับปาร์ตี้บาร์บีคิวซีฟู้ดและเครื่องดื่มริมทะเลยามค่ำคืน",
			TourPackageID:	    1,
		}
		ok, err := govalidator.ValidateStruct(descriptions)
		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("TripHighlight is required"))
	})
}

func TestPlacesHighlight(t *testing.T) {

	g := NewGomegaWithT(t)

	t.Run(`places_highlight is required`, func(t *testing.T) {
		descriptions := entity.TourDescriptions{
			Intro:   			"สัมผัสความเงียบสงบและธรรมชาติที่บริสุทธิ์ของทะเลระนอง เปิดโลกการท่องเที่ยวสุดเอ็กซ์คลูซีฟกับแพ็กเกจทัวร์ทะเลระนอง ดินแดนที่ยังคงความงดงามดั้งเดิมของธรรมชาติ ทะเลใส หาดทรายขาว และหมู่เกาะที่ซ่อนตัวอยู่ในความสงบ เหมาะสำหรับผู้ที่ต้องการพักผ่อนและหลีกหนีจากความวุ่นวายของชีวิตประจำวัน",        
			PackageDetail:		"จังหวัด: ระนอง ระยะเวลา: 2 วัน 2 คืน ที่พัก: รีสอร์ทหรูระดับ 4 ดาว พร้อมวิวทะเลส่วนตัว รวมอาหาร: อาหารครบทุกมื้อ เน้นซีฟู้ดสดใหม่จากทะเลระนอง การเดินทาง: รถรับ-ส่งสนามบินระนอง พร้อมเรือสปีดโบ๊ทส่วนตัวสำหรับทัวร์เกาะ",  
			TripHighlight:		"🏝️ ทัวร์หมู่เกาะกำและเกาะค้างคาว สัมผัสหาดทรายขาวละเอียดและน้ำทะเลใสราวคริสตัลที่หมู่เกาะกำ เพลิดเพลินกับการดำน้ำตื้น(Snorkeling) เพื่อชมปะการังหลากสีสัน และปลาสวยงามนานาชนิด 🌅 ชิลล์บนเกาะพยาม สัมผัสกับวิถีชีวิตเรียบง่ายบนเกาะพยาม เกาะที่ขึ้นชื่อว่า มัลดีฟส์เมืองไทย ชมความงดงามของชายหาดที่เงียบสงบและดื่มด่ำกับพระอาทิตย์ตกดินสุดโรแมนติก 🛶 ล่องเรือชมป่าชายเลนและน้ำตกปุญญบาล ตื่นตาตื่นใจกับความสมบูรณ์ของป่าชายเลนที่อุดมสมบูรณ์ สำรวจน้ำตกปุญญบาลที่มีน้ำใสไหลเย็นตลอดปี ✨ บ่อน้ำพุร้อนรักษะวาริน ผ่อนคลายกับการแช่น้ำแร่ร้อนธรรมชาติที่บ่อน้ำพุร้อนรักษะวาริน สถานที่ท่องเที่ยวเพื่อสุขภาพที่ไม่ควรพลาด", 
			PlacesHighlight:	"", //ผิดตรงนี้	
			TourPackageID:	    1,
		}
		ok, err := govalidator.ValidateStruct(descriptions)
		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("PlacesHighlight is required"))
	})
}

func TestTourPackageID(t *testing.T) {

	g := NewGomegaWithT(t)

	t.Run(`tour_package_id is required`, func(t *testing.T) {
		descriptions := entity.TourDescriptions{
			Intro:   			"สัมผัสความเงียบสงบและธรรมชาติที่บริสุทธิ์ของทะเลระนอง เปิดโลกการท่องเที่ยวสุดเอ็กซ์คลูซีฟกับแพ็กเกจทัวร์ทะเลระนอง ดินแดนที่ยังคงความงดงามดั้งเดิมของธรรมชาติ ทะเลใส หาดทรายขาว และหมู่เกาะที่ซ่อนตัวอยู่ในความสงบ เหมาะสำหรับผู้ที่ต้องการพักผ่อนและหลีกหนีจากความวุ่นวายของชีวิตประจำวัน",        
			PackageDetail:		"จังหวัด: ระนอง ระยะเวลา: 2 วัน 2 คืน ที่พัก: รีสอร์ทหรูระดับ 4 ดาว พร้อมวิวทะเลส่วนตัว รวมอาหาร: อาหารครบทุกมื้อ เน้นซีฟู้ดสดใหม่จากทะเลระนอง การเดินทาง: รถรับ-ส่งสนามบินระนอง พร้อมเรือสปีดโบ๊ทส่วนตัวสำหรับทัวร์เกาะ",  
			TripHighlight:		"🏝️ ทัวร์หมู่เกาะกำและเกาะค้างคาว สัมผัสหาดทรายขาวละเอียดและน้ำทะเลใสราวคริสตัลที่หมู่เกาะกำ เพลิดเพลินกับการดำน้ำตื้น(Snorkeling) เพื่อชมปะการังหลากสีสัน และปลาสวยงามนานาชนิด 🌅 ชิลล์บนเกาะพยาม สัมผัสกับวิถีชีวิตเรียบง่ายบนเกาะพยาม เกาะที่ขึ้นชื่อว่า มัลดีฟส์เมืองไทย ชมความงดงามของชายหาดที่เงียบสงบและดื่มด่ำกับพระอาทิตย์ตกดินสุดโรแมนติก 🛶 ล่องเรือชมป่าชายเลนและน้ำตกปุญญบาล ตื่นตาตื่นใจกับความสมบูรณ์ของป่าชายเลนที่อุดมสมบูรณ์ สำรวจน้ำตกปุญญบาลที่มีน้ำใสไหลเย็นตลอดปี ✨ บ่อน้ำพุร้อนรักษะวาริน ผ่อนคลายกับการแช่น้ำแร่ร้อนธรรมชาติที่บ่อน้ำพุร้อนรักษะวาริน สถานที่ท่องเที่ยวเพื่อสุขภาพที่ไม่ควรพลาด", 
			PlacesHighlight:	"🌊 ดำน้ำดูปะการังและปลาสวยงาม: สัมผัสประสบการณ์ดำน้ำที่น่าตื่นเต้นในน้ำทะเลใสแจ๋ว 🌴 พักผ่อนท่ามกลางธรรมชาติ: ที่พักสุดหรูที่โอบล้อมด้วยธรรมชาติที่งดงาม 🍹 ปาร์ตี้ริมชายหาด: เพลิดเพลินกับปาร์ตี้บาร์บีคิวซีฟู้ดและเครื่องดื่มริมทะเลยามค่ำคืน", 	
			TourPackageID:	    0,  //ผิดตรงนี้
		}
		ok, err := govalidator.ValidateStruct(descriptions)
		g.Expect(ok).NotTo(BeTrue())
		g.Expect(err).NotTo(BeNil())

		g.Expect(err.Error()).To(Equal("TourPackageID is required"))
	})
}